import matplotlib.pyplot as plt
import networkx as nx

# Створення графа 
# Логіка: ребра між містами означають, що області, обласними центрами яких є ці міста, 
# на мапі України є сусідніми, відображено з ким межує Київська область 
graph = {
    'Київ': ['Житомир', 'Вінниця', 'Черкаси', 'Полтава', 'Чернігів'],
    'Житомир': ['Київ', 'Вінниця'],
    'Вінниця': ['Житомир', 'Київ', 'Черкаси'],
    'Черкаси': ['Вінниця', 'Київ', 'Полтава'],
    'Полтава': ['Черкаси', 'Київ', 'Чернігів'],
    'Чернігів': ['Полтава', 'Київ']
}

G = nx.Graph(graph)
plt.figure(figsize=(10, 8))
nx.draw(G, 
        with_labels=True, 
        node_color='lightblue', 
        node_size=2000, 
        font_size=12, 
        font_weight='bold',
        edge_color='gray')
plt.title("Транспортна мережа", fontsize=16)
plt.show()